# Libraries

In [1]:
#Importar Bibliotecas

import pandas as pd
import numpy as np
import re


import warnings
warnings.filterwarnings("ignore")

 # Documentation

In [2]:
# Importar archivos
df_health = pd.read_csv('../data/HNP_StatsData Alfonso-Copy1.csv')
df_seaice = pd.read_csv('../data/seaice.csv')
df_temp = pd.read_csv('../data/GlobalLandTemperaturesByCountry.csv')
df_temp_change = pd.read_csv('../data/Temperatura_cambio.csv')
df_fires = pd.read_csv('../data/fires.csv')
df_iso = pd.read_csv('../data/iso.csv')
df_agri = pd.read_csv('../data/Agricultura.csv')
df_emissions_origen = pd.read_csv('../data/Emisiones_origen.csv')
df_emisiones = pd.read_csv('../data/owid-co2-data-Copy1.csv')

# Cleaning df_health

In [3]:
#selección de todas las filas que contengan los indicadores que me interesan

df_population = df_health[df_health['Indicator Name'].isin(['Urban population (% of total population)','Urban population growth (annual %)','Rural population (% of total population)', 'Rural population growth (annual %)', 'Population growth (annual %)', 'Population, total'])]
df_health_indicators = df_health[df_health['Indicator Name'].isin(['Treatment for hypertension (% of adults ages 30-79 with hypertension)',\
                                                                   'Total alcohol consumption per capita (liters of pure alcohol, projected estimates, 15+ years of age)',\
                                                                   'Suicide mortality rate (per 100,000 population)','People using at least basic drinking water services (% of population)', \
                                                                   'People using safely managed sanitation services (% of population)',\
                                                                   'Number of surgical procedures (per 100,000 population)',\
                                                                   'Mortality rate attributed to unsafe water, unsafe sanitation and lack of hygiene (per 100,000 population)',\
                                                                   'Mortality rate attributed to household and ambient air pollution (per 100,000 population)',\
                                                                   'Human capital index (HCI) (scale 0-1)', 'External health expenditure (% of current health expenditure)',\
                                                                   'Current health expenditure (% of GDP)', 'Current health expenditure per capita (current US$)',\
                                                                   'Domestic general government health expenditure (% of GDP)', 'Prevalence of overweight (% of adults)'])]

In [4]:
#Eliminar columnas que no me interesan
df_population = df_population.drop(['Unnamed: 66','Indicator Code'], axis = 1)
df_health_indicators = df_health_indicators.drop(['Unnamed: 66','Indicator Code'], axis = 1)

In [5]:
df_population.head(3)

,Country Name,Country Code,Indicator Name,1960,1961,1962,1963,1964,1965,1966,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
324,Africa Eastern and Southern,AFE,Population growth (annual %),NaN,2.660180e+00,2.732633e+00,2.753248e+00,2.806915e+00,2.840787e+00,2.813609e+00,...,2.740405e+00,2.780157e+00,2.774992e+00,2.802587e+00,2.728160e+00,2.655673e+00,2.688373e+00,2.691136e+00,2.678185e+00,2.607473e+00
329,Africa Eastern and Southern,AFE,"Population, total",1.306926e+08,1.341692e+08,1.378356e+08,1.416305e+08,1.456060e+08,1.497424e+08,1.539555e+08,...,5.525307e+08,5.678919e+08,5.836508e+08,6.000082e+08,6.163773e+08,6.327463e+08,6.497569e+08,6.672427e+08,6.851127e+08,7.029768e+08
391,Africa Eastern and Southern,AFE,Rural population (% of total population),8.543619e+01,8.518859e+01,8.493075e+01,8.465202e+01,8.435981e+01,8.405872e+01,8.374482e+01,...,6.695953e+01,6.652379e+01,6.606304e+01,6.557442e+01,6.510525e+01,6.464110e+01,6.415240e+01,6.366374e+01,6.317170e+01,6.267630e+01

In [6]:
df_health_indicators.head(3)

,Country Name,Country Code,Indicator Name,1960,1961,1962,1963,1964,1965,1966,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
98,Africa Eastern and Southern,AFE,Current health expenditure (% of GDP),NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,6.563003,6.565593,6.151985,6.482030,6.390371,6.317424,6.323236,6.272034,NaN,NaN
99,Africa Eastern and Southern,AFE,Current health expenditure per capita (current...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,112.687349,110.580640,103.961963,98.624206,94.215193,101.540030,95.443736,91.078351,NaN,NaN
108,Africa Eastern and Southern,AFE,Domestic general government health expenditure...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,2.931042,2.816077,2.807922,2.973679,2.853746,2.815905,3.006106,3.040864,NaN,NaN

In [7]:
#Reorganizar los datos dejando 'Year' como columna
df_population = df_population.melt(id_vars = ['Country Name', 'Country Code', 'Indicator Name']).rename({'variable': 'Year'}, axis=1 )
df_health_indicators = df_health_indicators.melt(id_vars = ['Country Name', 'Country Code', 'Indicator Name']).rename({'variable': 'Year'}, axis=1 )

In [8]:
df_population.head()

,Country Name,Country Code,Indicator Name,Year,value
0,Africa Eastern and Southern,AFE,Population growth (annual %),1960,NaN
1,Africa Eastern and Southern,AFE,"Population, total",1960,1.306926e+08
2,Africa Eastern and Southern,AFE,Rural population (% of total population),1960,8.543619e+01
3,Africa Eastern and Southern,AFE,Rural population growth (annual %),1960,NaN
4,Africa Eastern and Southern,AFE,Urban population (% of total population),1960,1.456381e+01

In [9]:
df_health_indicators.head()

,Country Name,Country Code,Indicator Name,Year,value
0,Africa Eastern and Southern,AFE,Current health expenditure (% of GDP),1960,NaN
1,Africa Eastern and Southern,AFE,Current health expenditure per capita (current...,1960,NaN
2,Africa Eastern and Southern,AFE,Domestic general government health expenditure...,1960,NaN
3,Africa Eastern and Southern,AFE,External health expenditure (% of current heal...,1960,NaN
4,Africa Eastern and Southern,AFE,Human capital index (HCI) (scale 0-1),1960,NaN

#### Data Population and health indicators

In [10]:
df_population.to_csv('../data/df_population.csv')

In [11]:
df_health_indicators.to_csv('../data/df_health_indicators.csv')

# Cleaning df_Seaice

In [12]:
df_seaice.head()

,Year,Month,Day,Extent,Missing,Source Data,hemisphere
0,1978,10,26,10.231,0.0,['ftp://sidads.colorado.edu/pub/DATASETS/nsid...,north
1,1978,10,28,10.420,0.0,['ftp://sidads.colorado.edu/pub/DATASETS/nsid...,north
2,1978,10,30,10.557,0.0,['ftp://sidads.colorado.edu/pub/DATASETS/nsid...,north
3,1978,11,1,10.670,0.0,['ftp://sidads.colorado.edu/pub/DATASETS/nsid...,north
4,1978,11,3,10.777,0.0,['ftp://sidads.colorado.edu/pub/DATASETS/nsid...,north

In [13]:
#Eliminar columnas que no me aportan valor
df_seaice = df_seaice.drop(['    Missing', ' Day', ' Month', ' Source Data'], axis = 1)

In [14]:
# Renombrar la columna '     Extent' a 'Extent'
df_seaice = df_seaice.rename(columns={'     Extent': 'Extent'})

In [15]:
#Agrupar por media y año, y reducir la tabla a 1 registro por año
mean_year = df_seaice.groupby('Year')['Extent'].mean()
df_mean_year_ice = pd.DataFrame({'Year': mean_year.index, 'Media': mean_year.values})
df_mean_year_ice = df_mean_year_ice.rename(columns={'Media': 'Ice Extent'})

In [16]:
df_mean_year_ice.head()

   Year  Ice Extent
0  1978   12.976838
1  1979   12.019349
2  1980   11.785219
3  1981   11.776148
4  1982   12.048755

#### Seaice Mean

In [17]:
df_mean_year_ice.to_csv('../data/df_Deshielo_Media')

# Cleaning df_temp

In [18]:
df_temp.head()

           dt  AverageTemperature  AverageTemperatureUncertainty Country
0  1743-11-01               4.384                          2.294   Åland
1  1743-12-01                 NaN                            NaN   Åland
2  1744-01-01                 NaN                            NaN   Åland
3  1744-02-01                 NaN                            NaN   Åland
4  1744-03-01                 NaN                            NaN   Åland

In [19]:
# Eliminar los registros por debajo de 1960
df_temp = df_temp[df_temp['dt'].str[:4].astype(int) >= 1960]

In [20]:
df_temp.head()

              dt  AverageTemperature  AverageTemperatureUncertainty Country
2594  1960-01-01              -4.380                          0.430   Åland
2595  1960-02-01              -5.233                          0.382   Åland
2596  1960-03-01              -2.362                          0.638   Åland
2597  1960-04-01               1.922                          0.450   Åland
2598  1960-05-01               8.495                          0.287   Åland

In [21]:
# Convertir la columna 'dt' a tipo datetime
df_temp['dt'] = pd.to_datetime(df_temp['dt'])

# Extraer el año de la columna 'dt'
df_temp['Year'] = df_temp['dt'].dt.year

# Eliminar la columna 'dt'
df_temp = df_temp.drop('dt', axis=1)

In [22]:
#Reindexar las columnas
df_temp = df_temp.reindex(columns = ['Year','Country', 'AverageTemperature', 'AverageTemperatureUncertainty' ])

df_temp.head()

In [23]:
# Agrupar por year y country, encontrar la media para cada año y cada país y asignar valores.
df_temp = df_temp.groupby(['Year', 'Country']).agg({'AverageTemperature': 'mean', 'AverageTemperatureUncertainty': 'mean'}).reset_index()
df_temp = df_temp.rename(columns={'AverageTemperature': 'Average_Temperature'})
df_temp = df_temp.rename(columns={'AverageTemperatureUncertainty': 'Average_Temperature_Uncertainty'})

In [24]:
df_temp.head()

   Year         Country  Average_Temperature  Average_Temperature_Uncertainty
0  1960     Afghanistan            13.985417                         0.441833
1  1960          Africa            24.305083                         0.208250
2  1960         Albania            13.335083                         0.318750
3  1960         Algeria            23.504083                         0.452083
4  1960  American Samoa            26.765500                         0.394000

In [25]:
df_temp.to_csv('../data/df_temp_media')

# Cleaning df_temp_change

In [26]:
df_temp_change.head()

,Domain Code,Domain,Area Code (M49),Area,Element Code,Element,Months Code,Months,Year Code,Year,Unit,Value,Flag,Flag Description
0,ET,Temperature change,4,Afghanistan,7271,Temperature change,7020,Meteorological year,1980,1980,°C,0.690,E,Estimated value
1,ET,Temperature change,4,Afghanistan,7271,Temperature change,7020,Meteorological year,1981,1981,°C,0.583,E,Estimated value
2,ET,Temperature change,4,Afghanistan,7271,Temperature change,7020,Meteorological year,1982,1982,°C,-0.237,E,Estimated value
3,ET,Temperature change,4,Afghanistan,7271,Temperature change,7020,Meteorological year,1983,1983,°C,0.213,E,Estimated value
4,ET,Temperature change,4,Afghanistan,7271,Temperature change,7020,Meteorological year,1984,1984,°C,0.210,E,Estimated value

In [27]:
# Eliminar columnas que no me interesan
df_temp_change = df_temp_change.drop(['Unit','Months', 'Domain','Domain Code', 'Area Code (M49)', 'Element Code', 'Months Code', 'Year Code', 'Flag'], axis = 1)

In [28]:
df_temp_change.head()

          Area             Element  Year  Value Flag Description
0  Afghanistan  Temperature change  1980  0.690  Estimated value
1  Afghanistan  Temperature change  1981  0.583  Estimated value
2  Afghanistan  Temperature change  1982 -0.237  Estimated value
3  Afghanistan  Temperature change  1983  0.213  Estimated value
4  Afghanistan  Temperature change  1984  0.210  Estimated value

In [29]:
#Reordenar las columnas
df_temp_change = df_temp_change.reindex(columns = ['Year', 'Area', 'Element', 'Value', 'Flag Description'])

In [30]:
#Renombrar las columnas
df_temp_change = df_temp_change.rename(columns = {'Area' : 'Country', 'Flag Description' : 'Description'})

In [31]:
# Añadir etiqueta de valor a value
df_temp_change["Value"] = df_temp_change["Value"].astype(str) + " ºC"

In [32]:
df_temp_change.head()

   Year      Country             Element      Value      Description
0  1980  Afghanistan  Temperature change    0.69 ºC  Estimated value
1  1981  Afghanistan  Temperature change   0.583 ºC  Estimated value
2  1982  Afghanistan  Temperature change  -0.237 ºC  Estimated value
3  1983  Afghanistan  Temperature change   0.213 ºC  Estimated value
4  1984  Afghanistan  Temperature change    0.21 ºC  Estimated value

In [33]:
df_temp_change.to_csv('../data/df_temp_change.csv')

# Cleaning df_fires

In [34]:
df_fires.head()

,Domain Code,Domain,Area Code (M49),Area,Element Code,Element,Item Code,Item,Year Code,Year,Source Code,Source,Unit,Value,Flag,Flag Description,Note
0,GI,Fires,4,Afghanistan,7246,Burned Area,6796,Humid tropical forest,1990,1990,3050,FAO TIER 1,ha,0.0,E,Estimated value,NaN
1,GI,Fires,4,Afghanistan,7246,Burned Area,6796,Humid tropical forest,1991,1991,3050,FAO TIER 1,ha,0.0,E,Estimated value,NaN
2,GI,Fires,4,Afghanistan,7246,Burned Area,6796,Humid tropical forest,1992,1992,3050,FAO TIER 1,ha,0.0,E,Estimated value,NaN
3,GI,Fires,4,Afghanistan,7246,Burned Area,6796,Humid tropical forest,1993,1993,3050,FAO TIER 1,ha,0.0,E,Estimated value,NaN
4,GI,Fires,4,Afghanistan,7246,Burned Area,6796,Humid tropical forest,1994,1994,3050,FAO TIER 1,ha,0.0,E,Estimated value,NaN

In [35]:
df_fires = df_fires.drop(['Flag Description', 'Element',  'Domain', 'Area Code (M49)', 'Element Code','Source', 'Unit', 'Flag', 'Item Code', 'Year Code', 'Source Code', 'Note', 'Domain Code'], axis = 1)

In [36]:
# Añadir etiqueta de valor a value
df_fires["Value"] = df_fires["Value"].astype(str) + " Ha"

In [37]:
df_fires.head()

          Area                   Item  Year   Value
0  Afghanistan  Humid tropical forest  1990  0.0 Ha
1  Afghanistan  Humid tropical forest  1991  0.0 Ha
2  Afghanistan  Humid tropical forest  1992  0.0 Ha
3  Afghanistan  Humid tropical forest  1993  0.0 Ha
4  Afghanistan  Humid tropical forest  1994  0.0 Ha

In [38]:
df_fires = df_fires.rename(columns = {'Area' : 'Country'})
df_fires = df_fires.reindex(columns = ['Year', 'Country', 'Value'])

In [39]:
df_fires.head()

   Year      Country   Value
0  1990  Afghanistan  0.0 Ha
1  1991  Afghanistan  0.0 Ha
2  1992  Afghanistan  0.0 Ha
3  1993  Afghanistan  0.0 Ha
4  1994  Afghanistan  0.0 Ha

In [40]:
df_fires.to_csv('../data/df_fires.csv')

# Cleaning df_agri

In [41]:
df_agri.head()

,Domain Code,Domain,Area Code (M49),Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value,Flag,Flag Description
0,EL,Land use indicators,4,Afghanistan,7209,Share in Land area,6610,Agricultural land,1980,1980,%,58.34,E,Estimated value
1,EL,Land use indicators,4,Afghanistan,7209,Share in Land area,6610,Agricultural land,1981,1981,%,58.34,E,Estimated value
2,EL,Land use indicators,4,Afghanistan,7209,Share in Land area,6610,Agricultural land,1982,1982,%,58.34,E,Estimated value
3,EL,Land use indicators,4,Afghanistan,7209,Share in Land area,6610,Agricultural land,1983,1983,%,58.34,E,Estimated value
4,EL,Land use indicators,4,Afghanistan,7209,Share in Land area,6610,Agricultural land,1984,1984,%,58.34,E,Estimated value

In [42]:
#ELiminar columnas, renombrarlas, reordenarlas y añadir elementos
df_agri = df_agri.drop(['Domain Code','Element', 'Domain', 'Area Code (M49)', 'Element Code', 'Item Code', 'Year Code', 'Unit', 'Flag', 'Flag Description'], axis = 1)
df_agri = df_agri.rename(columns = {'Area' : 'Country', 'Item' : 'Indicators'})
df_agri['Value'] = df_agri['Value'].astype(str) + ' %'
df_agri = df_agri.reindex(columns = ['Year', 'Country', 'Indicators', 'Value'])
df_agri.head()

   Year      Country         Indicators    Value
0  1980  Afghanistan  Agricultural land  58.34 %
1  1981  Afghanistan  Agricultural land  58.34 %
2  1982  Afghanistan  Agricultural land  58.34 %
3  1983  Afghanistan  Agricultural land  58.34 %
4  1984  Afghanistan  Agricultural land  58.34 %

In [43]:
df_agri.to_csv('../data/df_agri.csv')

# Cleaning df_emissions_origen

In [44]:
df_emissions_origen.head()

,Domain Code,Domain,Area Code (M49),Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value,Flag,Flag Description
0,EM,Emissions shares,4,Afghanistan,7264,Emissions Share (CO2),6996,Farm gate,1990,1990,%,72.2771,E,Estimated value
1,EM,Emissions shares,4,Afghanistan,7264,Emissions Share (CO2),6996,Farm gate,1991,1991,%,103.1012,E,Estimated value
2,EM,Emissions shares,4,Afghanistan,7264,Emissions Share (CO2),6996,Farm gate,1992,1992,%,-7.8862,E,Estimated value
3,EM,Emissions shares,4,Afghanistan,7264,Emissions Share (CO2),6996,Farm gate,1993,1993,%,-5.9066,E,Estimated value
4,EM,Emissions shares,4,Afghanistan,7264,Emissions Share (CO2),6996,Farm gate,1994,1994,%,-4.5758,E,Estimated value

In [45]:
df_emissions_origen = df_emissions_origen.drop(['Domain', 'Domain Code', 'Area Code (M49)', 'Element Code', 'Item Code', 'Unit', 'Year Code', 'Flag', 'Flag Description'], axis = 1)

In [46]:
df_emissions_origen.head()

          Area                Element       Item  Year     Value
0  Afghanistan  Emissions Share (CO2)  Farm gate  1990   72.2771
1  Afghanistan  Emissions Share (CO2)  Farm gate  1991  103.1012
2  Afghanistan  Emissions Share (CO2)  Farm gate  1992   -7.8862
3  Afghanistan  Emissions Share (CO2)  Farm gate  1993   -5.9066
4  Afghanistan  Emissions Share (CO2)  Farm gate  1994   -4.5758

In [47]:
df_emissions_origen = df_emissions_origen.rename(columns = {'Area' : 'Country', 'Item' : 'Indicators'})
df_emissions_origen['Value'] = df_emissions_origen['Value'].astype(str) + ' %'
df_emissions_origen = df_emissions_origen.reindex(columns = ['Year', 'Country', 'Element', 'Indicators','Value'])

In [48]:
df_emissions_origen.head()

   Year      Country                Element Indicators       Value
0  1990  Afghanistan  Emissions Share (CO2)  Farm gate   72.2771 %
1  1991  Afghanistan  Emissions Share (CO2)  Farm gate  103.1012 %
2  1992  Afghanistan  Emissions Share (CO2)  Farm gate   -7.8862 %
3  1993  Afghanistan  Emissions Share (CO2)  Farm gate   -5.9066 %
4  1994  Afghanistan  Emissions Share (CO2)  Farm gate   -4.5758 %

In [49]:
df_emissions_origen.to_csv('../data/df_emissions_origen.csv')

# Cleaning df_emisiones

In [50]:
df_emisiones.head()

,iso_code,country,year,co2,consumption_co2,co2_growth_prct,co2_growth_abs,trade_co2,co2_per_capita,consumption_co2_per_capita,...,ghg_per_capita,methane,methane_per_capita,nitrous_oxide,nitrous_oxide_per_capita,population,gdp,primary_energy_consumption,energy_per_capita,energy_per_gdp
0,AFG,Afghanistan,1949,0.015,NaN,NaN,NaN,NaN,0.002,NaN,...,NaN,NaN,NaN,NaN,NaN,7624058.0,NaN,NaN,NaN,NaN
1,AFG,Afghanistan,1950,0.084,NaN,475.0,0.070,NaN,0.011,NaN,...,NaN,NaN,NaN,NaN,NaN,7752117.0,9.421400e+09,NaN,NaN,NaN
2,AFG,Afghanistan,1951,0.092,NaN,8.7,0.007,NaN,0.012,NaN,...,NaN,NaN,NaN,NaN,NaN,7840151.0,9.692280e+09,NaN,NaN,NaN
3,AFG,Afghanistan,1952,0.092,NaN,0.0,0.000,NaN,0.012,NaN,...,NaN,NaN,NaN,NaN,NaN,7935996.0,1.001732e+10,NaN,NaN,NaN
4,AFG,Afghanistan,1953,0.106,NaN,16.0,0.015,NaN,0.013,NaN,...,NaN,NaN,NaN,NaN,NaN,8039684.0,1.063052e+10,NaN,NaN,NaN

In [57]:
df_emisiones.columns

Index(['Country', 'Year', 'co2', 'consumption_co2', 'co2_growth_prct',
       'co2_growth_abs', 'trade_co2', 'co2_per_capita',
       'consumption_co2_per_capita', 'share_global_co2', 'cumulative_co2',
       'share_global_cumulative_co2', 'co2_per_gdp', 'consumption_co2_per_gdp',
       'co2_per_unit_energy', 'coal_co2', 'cement_co2', 'flaring_co2',
       'gas_co2', 'oil_co2', 'other_industry_co2', 'cement_co2_per_capita',
       'coal_co2_per_capita', 'flaring_co2_per_capita', 'gas_co2_per_capita',
       'oil_co2_per_capita', 'other_co2_per_capita', 'trade_co2_share',
       'share_global_cement_co2', 'share_global_coal_co2',
       'share_global_flaring_co2', 'share_global_gas_co2',
       'share_global_oil_co2', 'share_global_other_co2',
       'cumulative_cement_co2', 'cumulative_coal_co2',
       'cumulative_flaring_co2', 'cumulative_gas_co2', 'cumulative_oil_co2',
       'cumulative_other_co2', 'share_global_cumulative_cement_co2',
       'share_global_cumulative_coal_co2',
       'share_global_cumulative_flaring_co2',
       'share_global_cumulative_gas_co2', 'share_global_cumulative_oil_co2',
       'share_global_cumulative_other_co2', 'total_ghg', 'ghg_per_capita',
       'methane', 'methane_per_capita', 'nitrous_oxide',
       'nitrous_oxide_per_capita', 'population', 'gdp',
       'primary_energy_consumption', 'energy_per_capita', 'energy_per_gdp'],
      dtype='object')

In [55]:
df_emisiones = df_emisiones.rename(columns = {'country' : 'Country', 'year' : 'Year'})
df_emisiones = df_emisiones.drop(columns = ['iso_code'])

In [58]:
df_emisiones.melt(id_vars = ['Country', 'Year']).rename(columns = {'variable' : 'Values'})

             Country  Year          Values  value
0        Afghanistan  1949             co2  0.015
1        Afghanistan  1950             co2  0.084
2        Afghanistan  1951             co2  0.092
3        Afghanistan  1952             co2  0.092
4        Afghanistan  1953             co2  0.106
...              ...   ...             ...    ...
1386215     Zimbabwe  2016  energy_per_gdp  1.889
1386216     Zimbabwe  2017  energy_per_gdp    NaN
1386217     Zimbabwe  2018  energy_per_gdp    NaN
1386218     Zimbabwe  2019  energy_per_gdp    NaN
1386219     Zimbabwe  2020  energy_per_gdp    NaN

[1386220 rows x 4 columns]

In [60]:
df_emisiones.to_csv('../data/df_emisiones')